## Prelim_AMPATIN

Import libraries needed that would help to make the codes more accesssible and possible to work.

In [1]:
#import libraries needed
import pandas as pd
import numpy as np

In [2]:
#from scikit-learn, import modules needed
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import confusion_matrix
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import f1_score

Prepare the data needed, these involves choosing right data and sorting null values and dropping them.

In [3]:
#using the dataset from the web
titanic=pd.read_csv('titanic_dataset.csv')

In [4]:
print(len(titanic))
print(titanic.head())

1309
   pclass  survived                                             name     sex  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

     age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.00      0      0   24160  211.3375       B5        S    2    NaN
1   0.92      1      2  113781  151.5500  C22 C26        S   11    NaN
2   2.00      1      2  113781  151.5500  C22 C26        S  NaN    NaN
3  30.00      1      2  113781  151.5500  C22 C26        S  NaN  135.0
4  25.00      1      2  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [5]:
zero_not_accepted=titanic.dropna(subset=['age', 'ticket', 'fare'])
zero_not_accepted.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
titanic=zero_not_accepted.drop(columns=['name','cabin','boat','body','home.dest','ticket','embarked'])
titanic.head()

   pclass  survived     sex    age  sibsp  parch      fare
0       1         1  female  29.00      0      0  211.3375
1       1         1    male   0.92      1      2  151.5500
2       1         0  female   2.00      1      2  151.5500
3       1         0    male  30.00      1      2  151.5500
4       1         0  female  25.00      1      2  151.5500

In [7]:
#change values to numerical
titanic['sex'].unique()
sex = {'female': 1, 'male': 0}
titanic['sex'].replace(sex, inplace=True)
titanic.head()

   pclass  survived  sex    age  sibsp  parch      fare
0       1         1    1  29.00      0      0  211.3375
1       1         1    0   0.92      1      2  151.5500
2       1         0    1   2.00      1      2  151.5500
3       1         0    0  30.00      1      2  151.5500
4       1         0    1  25.00      1      2  151.5500

In [8]:
titanic.isnull().sum()

pclass      0
survived    0
sex         0
age         0
sibsp       0
parch       0
fare        0
dtype: int64

In [9]:
X = titanic.drop(columns=['survived'])
y = titanic['survived']

Choosing a model, in here you have to consider everything in choosing. Here training and testing the right data helps you show the right result of the algorithm.

In [10]:
#KNN
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.15)
prediction = KNeighborsClassifier()
prediction.fit(X_train,y_train)
y_prediction=prediction.predict(X_test)

Display the result of the algorithm.

In [11]:
#display accuracy 
accuracy = accuracy_score(y_test, y_prediction)
accuracy

0.6560509554140127